# <strong> Subset Observations </strong>

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(
    [[1, 2, 3, 4, 5, 5, 21],
    [8, 9, 3, 11, 11, 20, 14],
    [1, 16, 17, 17, 19, 20, 21],
    [8, 9, 3, 11, 11, 20, 14]],
    columns = ['a','b','c','d','e','f','g']
    )

## logical criteria : Rows

In [4]:
df.b < 10

0     True
1     True
2    False
3     True
Name: b, dtype: bool

In [5]:
df[df.b < 10]

   a  b  c   d   e   f   g
0  1  2  3   4   5   5  21
1  8  9  3  11  11  20  14
3  8  9  3  11  11  20  14

<strong> Another form </strong>

In [6]:
df[df['b'] < 10]

   a  b  c   d   e   f   g
0  1  2  3   4   5   5  21
1  8  9  3  11  11  20  14
3  8  9  3  11  11  20  14

## Remove duplicate rows

In [7]:
df.drop_duplicates(inplace=False)

   a   b   c   d   e   f   g
0  1   2   3   4   5   5  21
1  8   9   3  11  11  20  14
2  1  16  17  17  19  20  21

## Head & Tail

In [11]:
df.head(2)

   a  b  c   d   e   f   g
0  1  2  3   4   5   5  21
1  8  9  3  11  11  20  14

In [19]:
df.tail(2)

   a   b   c   d   e   f   g
2  1  16  17  17  19  20  21
3  8   9   3  11  11  20  14

## Sample

<strong> Pick n rows randomly </strong>

In [23]:
df.sample(n=1)

   a  b  c   d   e   f   g
1  8  9  3  11  11  20  14

<strong> Pick frac percent of rows randomly </strong>

In [24]:
df.sample(frac=0.5)

   a  b  c   d   e   f   g
1  8  9  3  11  11  20  14
0  1  2  3   4   5   5  21

<strong> Replacement setting : default = None </strong>

In [26]:
df.sample(n=10, replace=True)

   a   b   c   d   e   f   g
0  1   2   3   4   5   5  21
1  8   9   3  11  11  20  14
0  1   2   3   4   5   5  21
2  1  16  17  17  19  20  21
3  8   9   3  11  11  20  14
0  1   2   3   4   5   5  21
3  8   9   3  11  11  20  14
3  8   9   3  11  11  20  14
0  1   2   3   4   5   5  21
2  1  16  17  17  19  20  21

## loc & iloc

In [39]:
df.loc['0':'3', 'a']

0    1
1    8
2    1
3    8
Name: a, dtype: int64

In [44]:
df.iloc[0:4]

   a   b   c   d   e   f   g
0  1   2   3   4   5   5  21
1  8   9   3  11  11  20  14
2  1  16  17  17  19  20  21
3  8   9   3  11  11  20  14

## nlargest & nsmallest

In [53]:
df.nlargest(2,'b')

   a   b   c   d   e   f   g
2  1  16  17  17  19  20  21
1  8   9   3  11  11  20  14

In [56]:
df.nsmallest(2,'b')

   a  b  c   d   e   f   g
0  1  2  3   4   5   5  21
1  8  9  3  11  11  20  14